{"class_name": "Model", "keras_version": "2.1.4", "backend": "tensorflow", "config": {"input_layers": [["inpx", 0, 0]], "name": "model_2", "output_layers": [["score", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "inpx", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "inpx"}}, {"inbound_nodes": [[["inpx", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_2", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_constraint": null, "filters": 32}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_2", "config": {"trainable": true, "name": "flatten_2"}}, {"inbound_nodes": [[["flatten_2", 0, 0, {}]]], "class_name": "Dense", "name": "wrap", "config": {"activation": "relu", "bias_regularizer": null, "bias_constraint": null, "units": 128, "name": "wrap", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null}}, {"inbound_nodes": [[["wrap", 0, 0, {}]]], "class_name": "Dense", "name": "score", "config": {"activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "units": 10, "name": "score", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null}}]}}